<template>
  <div id="scroll-board">
    <dv-scroll-board :config="config" />
  </div>
</template>

<script>
export default {
  name: 'ScrollBoard',
  data () {
    return {
      config: {
        header: ['时间', '交易所', '订货量', '交货量', '商品','商品单价'],
        data: [
          ['2020-07-01','国商商品交易中心有限公司', '28', '28', '泰山女儿茶','1200元/斤'],
          ['2019-07-02','威海国际海洋商品交易中心有限公司', '76', '80', '秘鲁鱿鱼','12500元/吨'],
          ['2015-05-29','日照大宗商品交易中心有限公司', '10000', '10000', 'PB面','445'],
          ['2019-07-04','临沂国际商品交易中心有限公司', '38', '38', 'LLDPE薄膜','8300'],
          ['2020-11-04','牡丹国际商品交易中心有限公司', '5791', '5791', '大蒜','2.32元/斤'],
          ['2020-10-31','牡丹国际商品交易中心有限公司', '4139', '4139', '大蒜','2.29元/斤'],
          ['2019-10-20','牡丹国际商品交易中心有限公司', '4585', '4545', '大蒜','2.05元/斤'],
          ['2019-10-15','牡丹国际商品交易中心有限公司', '3690', '3690', '大蒜','1.93元/斤'],
          ['2020-10-10','牡丹国际商品交易中心有限公司', '2915', '2915', '大蒜','1.90元/斤'],
          ['2020-09-30','牡丹国际商品交易中心有限公司', '7500', '7500', '大蒜','1.90元/斤'],
          ['2019-07-06','山东标金投资有限公司', '10.062', '10.062', '金','1313.50美元/盎司'],
          ['2018-06-15','山东鼎丰商品电子交易市场', '86', '86', '落叶松','1600元/m3'],
          ['2020-10-27','牡丹国际商品交易中心有限公司', '300', '300', '辣椒','6.58元/斤'],
          ['2020-11-04','牡丹国际商品交易中心有限公司', '300', '300', '辣椒','6.41元/斤']
        ],
        columnWidth: [180, 250],
        align: ['center', 'center', 'center', 'center','center','center'],
        rowNum: 7,
        headerBGC: '#1981f6',
        headerHeight: 45,
        oddRowBGC: 'rgba(0, 44, 81, 0.8)',
        evenRowBGC: 'rgba(10, 29, 50, 0.8)'
      }
    }
  }
}
</script>

<style lang="less">
#scroll-board {
  width: 100%;
  box-sizing: border-box;
  margin-left: 20px;
  height: 100%;
  overflow: hidden;

  .header {
    height: auto;
  }
}
</style>
